# Birthday attendance

* Source: http://orhancanceylan.com/facebook/data/science/interview/2020/05/17/sql_facebook_student-attendance.html
* Source: https://towardsdatascience.com/twenty-five-sql-practice-exercises-5fc791e24082        

Given the following two tables, write a query to return the fraction of students, rounded to two decimal places, who attended school (attendance = 1) on their birthday.

In [1]:
%load_ext sql
%sql postgresql://fknight:@localhost/postgres

In [2]:
%%html
<style>
table {float:left}
</style>

## The `attendance` table

In [3]:
%%sql

DROP TABLE IF EXISTS attendance;
CREATE TABLE attendance (
    student_id INT,
    school_date DATE,
    attendance INT
);

INSERT INTO attendance
VALUES
    (1, '2020-04-03', 0),
    (2, '2020-04-03', 1),
    (3, '2020-04-03', 1), 
    (1, '2020-04-04', 1), 
    (2, '2020-04-04', 1), 
    (3, '2020-04-04', 1), 
    (1, '2020-04-05', 0), 
    (2, '2020-04-05', 1), 
    (3, '2020-04-05', 1), 
    (4, '2020-04-05', 1);
    
SELECT * FROM attendance;

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
10 rows affected.
10 rows affected.

[(1, datetime.date(2020, 4, 3), 0),
 (2, datetime.date(2020, 4, 3), 1),
 (3, datetime.date(2020, 4, 3), 1),
 (1, datetime.date(2020, 4, 4), 1),
 (2, datetime.date(2020, 4, 4), 1),
 (3, datetime.date(2020, 4, 4), 1),
 (1, datetime.date(2020, 4, 5), 0),
 (2, datetime.date(2020, 4, 5), 1),
 (3, datetime.date(2020, 4, 5), 1),
 (4, datetime.date(2020, 4, 5), 1)]

## The `students` table

In [4]:
%%sql 

DROP TABLE IF EXISTS students;
CREATE TABLE students (
    student_id INT,
    school_id  INT,
    grade_level INT,
    date_of_birth DATE
);

INSERT INTO students
VALUES
    (1, 2, 5, '2012-04-03'),
    (2, 1, 4, '2013-04-04'),
    (3, 1, 3, '2014-04-05'), 
    (4, 2, 4, '2013-04-03');

SELECT * FROM students;

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
4 rows affected.
4 rows affected.

[(1, 2, 5, datetime.date(2012, 4, 3)),
 (2, 1, 4, datetime.date(2013, 4, 4)),
 (3, 1, 3, datetime.date(2014, 4, 5)),
 (4, 2, 4, datetime.date(2013, 4, 3))]

## The expected output

| birthday_attendance |
|-------------------- |
| 0.67                |

# Type your SQL below

In [5]:
# %% sql
#
# Type your query here